Repository: eunhyekoo/glo_project
Catalog: feedback/TMData/[Naver] WEBTOON LATAM_Zatanna & the Ripper.tmx
Source language: en
Languages: es_419

source: I’LL teach you sometime.
es_419: ALGÚN DÍA TE ENSEÑARÉ...

source: I will make myself disappear!!
es_419: ¡VOY A DESAPARECER!

source: Did that tell you anything?
es_419: ¿DESCUBRISTE ALGO CON ESO?

source: Not so fast.
es_419: NO TAN RÁPIDO.

source: Now it is something that mocks my pain.
es_419: AHORA ES ALGO QUE SE BURLA DE MI DOLOR.

source: w-WAIT don’t find! show me—, no! no!
es_419: ¡ESPERA...! ¡NO LO ENCUENTRES! ¡MUÉSTRAMELO...! ¡NO, NO!

source: Now remember, twist your wrists.
es_419: RECUERDA GIRAR LAS MUÑECAS.

source: Stuck
es_419: Atascada

source: but thanks ma’am!
es_419: ¡GRACIAS IGUAL, SEÑORA!

source: and... a recent victim of an abduction. and punted out of 2022 by an evil witch...
es_419: ADEMÁS... SOY VÍCTIMA RECIENTE DE UNA ABDUCCIÓN, Y UNA BRUJA MALIGNA ME SACÓ A PATADAS DE 2022...

source: ready?
es_419: ¿LISTO?

source: honestly, 21 has only been a series of failures, thus far.
es_419: HONESTAMENTE, HASTA AHORA, LOS 21 HAN ESTADO LLENOS DE TROPIEZOS.

source: Not bad, but...
es_419: NO ESTÁ MAL, PERO...

source: Why do you think I came to you and not them?
es_419: ¿POR QUÉ CREES QUE TE FUI A BUSCAR A TI Y NO A ELLOS?

source: aw crap.
es_419: UF, QUÉ MAL.

source: a pox on magic.
es_419: AL DIABLO CON LA MAGIA.

source: Í'm not sure...
es_419: AY, NO SÉ...

source: BLiMEY!
es_419: ¡CARAMBA!

source: or, if you’d prefer not to have any—
es_419: SI PREFIERES, TAMBIÉN PUEDO HACER QUE NO...

source: there we go. can you sing for the crowd too?
es_419: PERFECTO. ¿Y QUÉ TE PARECE SI LES CANTAS ALGO?

source: I completely agree, cat.
es_419: ESTOY COMPLETAMENTE DE ACUERDO, GATITO.

source: Just not meat pies for breakfast.
es_419: ¡PERO NO PASTELES DE CARNE EN EL DESAYUNO!

source: What if you were the bait?!
es_419: ¡¿Y SI TÚ FUERAS EL SEÑUELO?!

source: What a crazy day!!
es_419: ¡QUÉ DÍA MÁS LOCO...!

source: “Turn your elbow in.
es_419: “METE EL CODO PARA ADENTRO.

source: Flats
es_419: COLORES PLANOS

source: They said that it’s expected, considering our line of_x0003_work...
es_419: DICEN QUE ES LO ESPERADO, TENIENDO EN CUENTA NUESTRO TRABAJO...

source: Well, What do you think, Zatanna?
es_419: ¿QUÉ PIENSAS, ZATANNA?

source: I eat things!
es_419: COMO DE TODO...

source: emoh.
es_419: ASAC.

source: If I can just...get it to open!
es_419: SI TAN SOLO... PUDIERA... ABRIRLA...

source: I need help retracing my steps. you_x0003_busy?
es_419: NECESITO ALGO DE AYUDA PARA VOLVER SOBRE MIS PASOS. ¿ESTÁN OCUPADAS?

source: Mmm hmm.
es_419: AJÁ...

source: HAHAHA!
es_419: ¡JA, JA, JA!

source: dessim
es_419: SODARONGI

source: I’m not sure how much I can do.
es_419: NO SÉ QUÉ TANTO PODRÉ AYUDARTE.

source: faulty magic. bad memory.
es_419: MAGIA FALLIDA, MALA MEMORIA.

source: Emoh...!
es_419: ¡ASAC...!

source: ...By completely pretending nothing was wrong.
es_419: ... PRETENDIENDO COMO SI NO ESTUVIERA OCURRIENDO NADA MALO.

source: oh, SILENCE my dear.
es_419: CÁLLATE, QUERIDA.

source: ...because if i’m not careful, the spell ends up literal.
es_419: ... PORQUE, SI NO TENGO CUIDADO, EL HECHIZO PODRÍA SALIR LITERAL...

source: But at least I have some kind of lead, now.
es_419: PERO, AL MENOS, AHORA TENGO UNA PISTA O ALGO ASÍ...

source: I think it might help.
es_419: TAL VEZ ME SEA ÚTIL.

source: I don’t think they’re in the mood to basement dive.
es_419: CREO QUE NO ESTÁN DE ÁNIMOS COMO PARA IR A TOMAR ALGO.

source: I told you I’m a light sleeper, roz. I would have heard.
es_419: TE DIJE QUE TENGO EL SUEÑO LIGERO, ROZ; HABRÍA ESCUCHADO CUALQUIER RUIDO.

source: Laever!{j}Laever!
es_419: ¡...RALEVER!

source: has someone already been in here...?
es_419: ¿ENTRÓ ALGUIEN MÁS AQUÍ...?

source: AND Now, to commence my great esca—
es_419: AHORA, QUE COMIENCE MI GRAN ESCA...

source: so it’s been easy for me to hide in his shadow.
es_419: ASÍ QUE A MÍ SE ME HIZO FÁCIL OCULTARME TRAS SU SOMBRA.

source: HEY! that’s going too far!!
es_419: ¡EH! ¡TE ESTÁS PASANDO DE LISTO!

source: ah-hah...
es_419: JE, JE...

source: And I don’t want you to—
es_419: Y NO QUIERO QUE...

source: What did you do to him?!
es_419: ¡¿QUÉ LE HICISTE?!

source: out of the way!!
es_419: ¡SALGAN DE AQUÍ!

source: Maybe the way to get home is by following magic that works.
es_419: QUIZÁ LA ÚNICA FORMA DE VOLVER A CASA SEA USAR MAGIA QUE FUNCIONE.

source: Protection
es_419: Protección

source: You can stay at my place around the corner.
es_419: SI QUIERES, PUEDES QUEDARTE EN MI CASA, QUE ESTÁ AQUÍ CERCA.

source: most of our families are gone.
es_419: LA MAYORÍA YA NO TENEMOS FAMILIA.

source: and I don’t have the best control of my practice.
es_419: NO TENGO MUCHO CONTROL SOBRE LA PRÁCTICA.

source: shoot. when did I pass out?
es_419: MALDICIÓN. ¿CUÁNDO ME DESMAYÉ?

source: oh?
es_419: ¿EH?

source: oh here!
es_419: ¡LISTO!

source: anyways!
es_419: ¡COMO SEA!

source: Now, MY ASSiSTANT will pull a LiVE rabbit from this hat!
es_419: ¡AHORA, MI ASISTENTE HARÁ APARECER UN CONEJO VIVO DEL SOMBRERO!

source: the east end of london, dear. whitechapel. did you get lost?
es_419: AL ESTE DE LONDRES, QUERIDA. EN WHITECHAPEL. ¿ESTÁS PERDIDA?

source: well, Look at me!
es_419: ¡VAYA, VAYA! ¡MÍRENME!

source: CONGRATU- LATIONS!!
es_419: ¡FELICITACIONES!

source: ...I had missed something worth hiding away.
es_419: ... SE ME HUBIERA PASADO POR ALTO ALGO QUE VALGA LA PENA ESCONDER.

source: let’s cut the cake...!
es_419: ¡CORTEMOS LA TORTA...!

source: AND ALWAYS Make sure the silver part is facing away from you!
es_419: ¡ASEGÚRENSE DE QUE LA PARTE PLATEADA APUNTE HACIA LA OTRA PERSONA!

source: ...and mock my failure with glee.
es_419: ... Y BURLARSE ALEGREMENTE DE MIS ERRORES.

source: I’ve been out before!
es_419: ¡CONOZCO BIEN LA CALLE!

source: I need to get out of here.
es_419: TENGO QUE SALIR DE AQUÍ.

source: I was trying to find its owner, But I sort of flubbed the spell.
es_419: ESTABA INTENTANDO ENCONTRAR AL DUEÑO, PERO METÍ LA PATA CON EL HECHIZO.

source: And who...?
es_419: ¿Y QUIÉN...?

source: Thanks guys!
es_419: ¡GRACIAS A TODOS!

source: challenge accepted.
es_419: ACEPTO EL DESAFÍO.

source: JUST MY LUCK.
es_419: QUÉ SUERTE LA MÍA...

source: I’ll need to ask the locals—
es_419: TENGO QUE HABLAR CON LA GENTE DE LA ZONA...

source: Blimey.
es_419: CARAMBA.

source: I’ve been hexed.
es_419: ME MALDIJERON.

source: I’d rather not be burned at stake before 22.
es_419: NO QUISIERA QUE ME QUEMARAN EN LA HOGUERA ANTES DE CUMPLIR 22.

source: hmmp.
es_419: MMM...

source: That one’s on me.
es_419: ES CULPA MÍA.

source: oh no, no-! i’m just a magician..!
es_419: ¡AH, NO, NO! ¡SOLO SOY MAGA!

source: the last time I tried a normal spell,
es_419: LA ÚLTIMA VEZ QUE INTENTÉ REALIZAR UN HECHIZO COMÚN...

source: I gotta know what’s in that box.
es_419: QUIERO SABER QUÉ HAY DENTRO DE LA CAJA.

source: That’s all?
es_419: ¿ESO ES TODO?

source: Are you trying to destroy it?!
es_419: ¡¿ESTÁS INTENTANDO DESTRUIRLO?!

source: The only place I’ll ever be.
es_419: EL ÚNICO LUGAR EN EL QUE ESTARÉ.

source: Alright, let's get Colton back!
es_419: ¡BIEN! ¡AHORA HAGAMOS QUE COLTON VUELVA!

source: Can’t say I have.
es_419: NO TUVE EL PLACER.

source: Oh, uhm...
es_419: AH, EH...

source: I’ve seen magicians.
es_419: CONOZCO A LAS MAGAS.

source: what's with her?!
es_419: ¡¿QUÉ LE PASA?!

source: Figures.
es_419: ME IMAGINÉ.

source: EiTNU!
es_419: ¡RATASED!

source: no, no, no, Just need to rest!
es_419: NO, NO. ¡SOLO QUIERO DESCANSAR UN POCO!

source: Nonsense!!
es_419: ¡TONTERÍAS!

source: If you are ever lost or unfocused, put on your hat.
es_419: SI ALGUNA VEZ TE SIENTES PERDIDA O CONFUNDIDA, PONTE EL SOMBRERO.

source: Gulp!
es_419: ¡GLUP!

source: -ERF...!
es_419: ¡...IUQ!

source: So “evlos siht redrum” would only work if the spell had a target.
es_419: POR ESO, "REVLOSER ETSE OTANISESA" SOLO FUNCIONARÍA SI EL HECHIZO TUVIERA UN OBJETIVO.

source: We just love you so much, Zatanna.
es_419: TE QUEREMOS MUCHO, ZATANNA.

source: So are you gonna burn me at the stake?
es_419: ¿ME QUEMARÁS EN LA HOGUERA?

source: What if we just set a trap?
es_419: ¿Y SI TENDEMOS UNA TRAMPA?

source: and now, the little hope i have gets smaller.
es_419: AHORA, LO POCO QUE TENÍA DE ESPERANZA ESTÁ POR DESAPARECER...

source: W-what did you just say to me?
es_419: ¿Q-QUÉ ACABAS DE DECIR...?

source: ...would rather not get tomatoes thrown at me.
es_419: ... PREFERIRÍA QUE NO ME ARROJARAN TOMATES A LA CARA.

source: There’s a pocket in there?
es_419: ¿TIENES UN BOLSILLO AHÍ DENTRO?

source: we’re not in salem, LOSERS.
es_419: ¡NO ESTAMOS EN SALEM, PERDEDORES!

source: Every good magician should do some tricks without magic.
es_419: LOS BUENOS MAGOS DEBEN SABER HACER TRUCOS SIN MAGIA.

source: you might’ve even seen his lair!
es_419: ¡QUIZÁ HAYAS VISTO SU GUARIDA!

source: what?
es_419: ¿QUÉ?

source: like, “Who killed agnes”?
es_419: ¿ALGO ASÍ COMO "QUIÉN MATÓ A AGNES"?

source: couldn’t hurt to take a peek...
es_419: NO PASARÁ NADA SI ECHO UN VISTAZO...

source: Yes, Mary’s in the back.
es_419: SÍ, MARY ESTÁ ATRÁS.

source: You ought to BE careful.
es_419: TIENES QUE TENER MUCHO CUIDADO.

source: let’s try the cop.
es_419: PREGUNTÉMOSLE AL POLICÍA.

source: welcome!
es_419: ¡ADELANTE!

source: is that a busker?
es_419: ¿ES MÚSICA CALLEJERA?

source: and meanwhile something is after all of us...
es_419: Y, MIENTRAS TANTO, ALGO NOS PERSIGUE...

source: wohs felsrouy, egam!
es_419: ¡ETARTSÉUM, AGAM!

source: Episode 2:
es_419: Episodio 2:

source: So, I lost it a little bit.
es_419: ASÍ QUE ME VOLVÍ UN POCO LOCA.

source: WELL I...
es_419: BUENO, YO...

source: NOT WHEN I NEEDED them MOST.
es_419: NO CUANDO MÁS LOS NECESITABA.

source: I-I almost got it, I’m sure...
es_419: CASI LO CONSIGO, ESTOY SEGURA...

source: She’s gone!
es_419: ¡DESAPARECIÓ…!

source: —But my Father would disown me if anyone saw me!
es_419: PERO, SI ALGUIEN ME VE, ¡MI PADRE ME DESHEREDARÁ!

source: And she seems like such a sweet girl.
es_419: PARECE SER UNA CHICA MUY DULCE.

source: Agnes! so glad to see you!
es_419: ¡AGNES! ¡ME ALEGRO DE VERLAS!

source: Just curious! if there’s a really weird guy, or...
es_419: ¡PREGUNTO POR CURIOSIDAD! ¿CONOCES A ALGÚN RARITO O...?

source: ...sure, I’m listening.
es_419: TE ESCUCHO...

source: 2022, here I come!
es_419: ¡2022, AHÍ VOY!

source: Nice to meet you both!
es_419: ¡ES UN PLACER CONOCERLAS!

source: HEY YOU two—
es_419: HOLA, CHICAS...

source: Just two pence a night.
es_419: POR SOLO DOS PENIQUES LA NOCHE.

source: My father was the most powerful magician in the world, too.
es_419: MI PADRE TAMBIÉN ERA EL MAGO MÁS PODEROSO DEL MUNDO.

source: and he waits until your 21st to give you so much as a warning?
es_419: ¿Y ESPERÓ HASTA QUE CUMPLISTE 21 AÑOS Y NI SIQUIERA TE LO ADVIRTIÓ?

source: ugh, what a razzle- dazzle!
es_419: ¡UFF, QUÉ ESTRAMBÓTICO!

source: GET YOUR FRUITS HERE!
es_419: ¡COMPRE SUS FRUTAS AQUÍ!

source: would another look at the bedroom help?
es_419: ¿SERVIRÍA DE ALGO ECHARLE OTRA MIRADA A LA HABITACIÓN?

source: We’re at Rosie’s place.
es_419: NOSOTRAS VIVIMOS EN LO DE ROSIE.

source: How much more do you have to say?
es_419: ¿HACE FALTA QUE DIGAS ALGO MÁS?

source: ah, it’s fine,
es_419: ESTÁ BIEN.

source: NOPE.
es_419: NO.

source: Either way, these are our clues.
es_419: EN CUALQUIER CASO, ESTAS SON NUESTRAS PISTAS.

source: Can I hang on to this?
es_419: ¿PUEDO QUEDÁRMELO?

source: but this isn’t just a warning to agnes.
es_419: PERO ESTA NO ES UNA ADVERTENCIA PARA AGNES...

source: We aren’t babies!
es_419: ¡NO SOMOS BEBÉS!

source: iT’s just Some ring.
es_419: UN ANILLO.

source: Nope,{j}nope,{j}nope!
es_419: ¡NO,{j}NO,{j}NO!

source: Nice to meet you!
es_419: ¡MUCHO GUSTO!

source: YOU brought him back.
es_419: TÚ LO TRAJISTE DE VUELTA.

source: And this is how I realized how dire my situation really was.
es_419: Y ENTONCES ME DI CUENTA DE LO GRAVE QUE ERA MI SITUACIÓN.

source: Okay, Zatanna.
es_419: BIEN, ZATANNA.

source: do you girls ever get any super weird, poetry? or like, love- letters from johns?
es_419: ¿SUELEN RECIBIR POEMAS MUY EXTRAÑOS O CARTAS DE AMOR DE LOS CLIENTES?

source: HAHA HAH!
es_419: ¡JA, JA! ¡JA, JA!

source: ah! what can I get—
es_419: ¡AH! ¿EN QUÉ LO PUEDO...?

source: Why?
es_419: ¿POR QUÉ?

source: HRMF?
es_419: ¿EHH?

source: ehhh-
es_419: EHH...

source: and I don’t really know how to leave.....
es_419: Y NO TENGO IDEA DE CÓMO VOLVER...

source: Art Direction
es_419: DIRECCIÓN DE ARTE

source: ...what year is it?
es_419: ¿EN QUÉ AÑO ESTAMOS...?

source: I have a new guest.
es_419: TENGO UNA INVITADA NUEVA.

source: Should we get out of here, John?
es_419: ¿QUÉ TE PARECE SI NOS VAMOS A OTRO LADO, JOHN?

source: What’s your name, again?
es_419: ¿CÓMO TE LLAMABAS?

source: And by your own father!
es_419: ¡TU PROPIO PADRE!

source: Where’s my boy?
es_419: ¿DÓNDE ESTÁ MI HIJO?

source: holy crap.
es_419: MIERDA.

source: magic in theory has little in common with magic in practice.
es_419: LA TEORÍA MÁGICA NO TIENE MUCHA RELACIÓN CON LA PRÁCTICA MÁGICA.

source: UHHH?!
es_419: ¡¿EHHH...?!

source: credits
es_419: CRÉDITOS

source: Okay, you wanna see something cool?
es_419: ¿QUIEREN VER ALGO DIVERTIDO?

source: Was there a light here just now??
es_419: ¡¿VI UNA LUZ AQUÍ O ME PARECIÓ?!

source: There are instructions on the back.
es_419: LAS INSTRUCCIONES ESTÁN EN LA PARTE DE ATRÁS.

source: dad said Magic had always been something that came naturally to me.
es_419: PAPÁ DIJO QUE LA MAGIA SIEMPRE FUE ALGO NATURAL PARA MÍ.

source: Where am I?
es_419: ¿DÓNDE ESTOY?

source: come quickly LADiES!
es_419: ¡VENGAN, CHICAS!

source: kcart:
es_419: RAERTSAR:

source: I hope your_x0003_friend turns_x0003_up safe and_x0003_sound.
es_419: ESPERO QUE TU AMIGA VUELVA SANA Y SALVA.

source: Y-You’re kicking me out of the band?
es_419: ¿ME...? ¿ME ESTÁS ECHANDO DE LA COMPAÑÍA?

source: silk & more
es_419: SEDA Y ALGO MÁS

source: Alright, I left some clothes for you on the chair.
es_419: TE DEJÉ ALGO DE ROPA SOBRE LA SILLA.

source: ZATANNA, JUST GO!!
es_419: ¡ZATANNA, VETE!

source: Now to commence my great escape.
es_419: QUE COMIENCE MI GRAN ESCAPE.

source: Are they gone?
es_419: ¿YA SE FUERON?

source: I don’t think I’ve met you before.
es_419: CREO QUE NO TE CONOZCO...

source: What do you mean you are good, dear?
es_419: ¿QUÉ QUIERES DECIR CON QUE ESTÁS BIEN?

source: Something so evil, so rotten....
es_419: ALGO MALIGNO, PODRIDO...

source: nope!
es_419: NO!

source: HEY!
es_419: ¡OYE!

source: You’re dumb!!
es_419: ¡ERES UNA TONTA!

source: what a gal!
es_419: ¡QUÉ MUCHACHA!

source: indeed I am!
es_419: ¡LA MISMA!

source: aughhh...!
es_419: ¡AUGHHHH...!

source: My god, it’s JUST horrible! the poor woman!
es_419: ¡DIOS MÍO! ¡QUÉ HORRIBLE! ¡POBRE MUJER!

source: Well, whatever you want to call it, you still should be careful dear.
es_419: BUENO, PONTE EL NOMBRE QUE QUIERAS, PERO DEBERÍAS TENER CUIDADO, CARIÑO.

source: DEAR FRiENDS, I AM PROUD TO PRESENT TO YOU...
es_419: DAMAS Y CABALLEROS, ME ENORGULLECE PRESENTARLES A...

source: happy birthday toYou! happy birthday toYou!
es_419: ¡QUE LOS CUMPLAS FELIZ! ¡QUE LOS CUMPLAS FELIZ!

source: Let’s try this again.
es_419: VAMOS A PROBAR OTRA VEZ.

source: Magic, let’s do some magic.
es_419: MAGIA. HAGAMOS ALGO DE MAGIA.

source: Episode 1:
es_419: Episodio 1:

source: ...let’s take a look at venues after the show, hm? we can open your present together!
es_419: ... DESPUÉS DEL ESPECTÁCULO, VAYAMOS A VER LOCACIONES. ¿QUIERES? ¡Y LUEGO ABRIMOS TU REGALO!

source: C REAK.
es_419: CRAC.

source: Just like with dad.
es_419: COMO CON PAPÁ.

source: a cop?!
es_419: ¡¿ES POLICÍA?!
